   {
        "id": "092ej19b7-0ac7-42c0-b3410-055hj2k34na8",
       "title": "Dave Ward Mansion",
        "date": "Dec 8, 2025",
        "content": "Conway, Arkansas — For years, a large, unfinished home sat quietly along Dave Ward Drive, earning the nickname “Dave Ward Mansion” among locals. Once envisioned as a grand private residence, the house never reached completion, leaving behind a story more about ambition gone awry than scandal.\n\n\n\nConstruction began in the 1990s, with plans for an expansive home featuring multiple levels and wide, open rooms. The structure promised to be one of the most impressive in Conway, but the project soon ran into trouble. Costs rose quickly, upkeep became challenging, and the sheer scale of the build proved overwhelming for the owners.\n\n\n\nBy the early 2000s, the mansion had been abandoned. Partially finished rooms, exposed staircases, and incomplete spaces turned the house into a ghostly monument to what could have been. With no residents or utilities, it fell into decay and became a magnet for curious teens, photographers, and local explorers.\n\n\n\nThe mansion met its dramatic end in 2013 when a fire consumed the already derelict building. Authorities reported that most of the structure was destroyed, leaving only the foundation and scattered remains. No evidence of foul play has been publicly reported, and the damage was too extensive for any restoration. Since then, the site has remained empty, a quiet reminder of a dream left unfinished.\n\n\n\nEven though the mansion no longer stands, it continues to capture the imagination of the community. Over time, it has become a fixture of Conway folklore, a story that blurs the line between myth and memory. Today, the lot along Dave Ward Drive remains still and vacant, a silent testament to ambition that never fully materialized."
    }
   {
        "id": "071ef0b7-0ac7-42c0-b280-055ce2e64fb5",
        "title": "Monte Ne, Arkansas: Dreams and Ruins",
        "date": "2025-08-06",
        "content": "Tucked away in the Ozarks near Rogers, Arkansas, Monte Ne was once meant to be a spectacular resort and bustling town. In the early 1900s, William “Coin” Hope Harvey purchased the land with dreams of building a luxurious getaway, complete with bathhouses, piers, and a massive amphitheater known as the Pyramid of Monte Ne—a city of the future.\n\nFor a while, visitors came to enjoy the springs and the scenic surroundings. But Harvey’s plans depended on uncertain finances, and the remote location made it hard to keep the town alive. By the late 1920s, Monte Ne was falling apart. The Great Depression, unfinished buildings, and the slow return of the forest left behind crumbling foundations and partially sunken ruins.\n\nToday, Monte Ne draws urban explorers and history buffs alike. The Pyramid still juts from Beaver Lake, a quiet reminder of big dreams that never fully came to life. Walking among the ruins gives a rare glimpse of a place where ambition, nature, and time meet.",
        "createdAt": 1765397683233,
        "updatedAt": 1765397683233
    }
